###############################################################################
# Created by write_sdc
# Tue Jun  2 13:18:29 2026
###############################################################################
current_design axi_wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ACLK}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARADDR[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARESETn}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARPROT[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARPROT[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARPROT[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARVALID}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWADDR[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWPROT[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWPROT[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWPROT[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWVALID}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {BREADY}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RREADY}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WDATA[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WSTRB[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WSTRB[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WSTRB[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WSTRB[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WVALID}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ARREADY}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {AWREADY}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {BRESP[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {BRESP[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {BVALID}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RDATA[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RRESP[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RRESP[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RVALID}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {WREADY}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {ARREADY}]
set_load -pin_load 0.0334 [get_ports {AWREADY}]
set_load -pin_load 0.0334 [get_ports {BVALID}]
set_load -pin_load 0.0334 [get_ports {RVALID}]
set_load -pin_load 0.0334 [get_ports {WREADY}]
set_load -pin_load 0.0334 [get_ports {BRESP[1]}]
set_load -pin_load 0.0334 [get_ports {BRESP[0]}]
set_load -pin_load 0.0334 [get_ports {RDATA[31]}]
set_load -pin_load 0.0334 [get_ports {RDATA[30]}]
set_load -pin_load 0.0334 [get_ports {RDATA[29]}]
set_load -pin_load 0.0334 [get_ports {RDATA[28]}]
set_load -pin_load 0.0334 [get_ports {RDATA[27]}]
set_load -pin_load 0.0334 [get_ports {RDATA[26]}]
set_load -pin_load 0.0334 [get_ports {RDATA[25]}]
set_load -pin_load 0.0334 [get_ports {RDATA[24]}]
set_load -pin_load 0.0334 [get_ports {RDATA[23]}]
set_load -pin_load 0.0334 [get_ports {RDATA[22]}]
set_load -pin_load 0.0334 [get_ports {RDATA[21]}]
set_load -pin_load 0.0334 [get_ports {RDATA[20]}]
set_load -pin_load 0.0334 [get_ports {RDATA[19]}]
set_load -pin_load 0.0334 [get_ports {RDATA[18]}]
set_load -pin_load 0.0334 [get_ports {RDATA[17]}]
set_load -pin_load 0.0334 [get_ports {RDATA[16]}]
set_load -pin_load 0.0334 [get_ports {RDATA[15]}]
set_load -pin_load 0.0334 [get_ports {RDATA[14]}]
set_load -pin_load 0.0334 [get_ports {RDATA[13]}]
set_load -pin_load 0.0334 [get_ports {RDATA[12]}]
set_load -pin_load 0.0334 [get_ports {RDATA[11]}]
set_load -pin_load 0.0334 [get_ports {RDATA[10]}]
set_load -pin_load 0.0334 [get_ports {RDATA[9]}]
set_load -pin_load 0.0334 [get_ports {RDATA[8]}]
set_load -pin_load 0.0334 [get_ports {RDATA[7]}]
set_load -pin_load 0.0334 [get_ports {RDATA[6]}]
set_load -pin_load 0.0334 [get_ports {RDATA[5]}]
set_load -pin_load 0.0334 [get_ports {RDATA[4]}]
set_load -pin_load 0.0334 [get_ports {RDATA[3]}]
set_load -pin_load 0.0334 [get_ports {RDATA[2]}]
set_load -pin_load 0.0334 [get_ports {RDATA[1]}]
set_load -pin_load 0.0334 [get_ports {RDATA[0]}]
set_load -pin_load 0.0334 [get_ports {RRESP[1]}]
set_load -pin_load 0.0334 [get_ports {RRESP[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ACLK}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARESETn}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARVALID}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWVALID}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BREADY}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {RREADY}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WVALID}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARADDR[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARPROT[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARPROT[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ARPROT[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWADDR[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWPROT[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWPROT[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {AWPROT[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WDATA[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WSTRB[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WSTRB[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WSTRB[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WSTRB[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
